#include "init.h"

volatile uint32_t i = 0;
volatile uint32_t j = 0;


int main(void)
{
    // инициализация системных частот
    CLKinit ();
    // инициализация аппаратного таймера 1мс
    TimerInit ();
	// инициализация программных таймеров задач
	TimeEventInit ();

	while (1)
	{
        TimersUpdate ();

        if ( TimerEvent (test) ) {
            i++;
		}
		j--;
	}
}


/****************************************************************************
 * 
 * прерывания
 * 
 ***************************************************************************/

